{"id":58,"date":"2014-09-18T18:12:54","date_gmt":"2014-09-18T18:12:54","guid":{"rendered":"http:\/\/easyupc.com\/new\/?page_id=58"},"modified":"2021-12-30T13:19:26","modified_gmt":"2021-12-30T06:19:26","slug":"frequently-asked-questions","status":"publish","type":"page","link":"https:\/\/upcs.com\/frequently-asked-questions\/","title":{"rendered":"Frequently Asked Questions"},"content":{"rendered":"<p>Below you will find a list of questions that will answer the most common questions about UPC codes and their use.  Please fully read through this page and contact us if you have any other questions.<\/p>\n\n<p class=\"p1\"><span class=\"s1\">\n<script type=\"application\/ld+json\">\n\t{\n\t\t\"@context\": \"https:\/\/schema.org\",\n\t\t\"@type\": \"FAQPage\",\n\t\t\"mainEntity\": [\n\t\t\t\t\t{\n\t\t\t\t\"@type\": \"Question\",\n\t\t\t\t\"name\": \"How do you buy UPC codes?\",\n\t\t\t\t\"acceptedAnswer\": {\n\t\t\t\t\t\"@type\": \"Answer\",\n\t\t\t\t\t\"text\": \"You can purchase UPC codes directly on our site at upcs.com.  All of our codes come from the GS1 with no renewal or hidden fees, and are delivered instantly at checkout.  They work with all vendors including Amazon, Google Shopping, iTunes, eBay, and more!\"\n\t\t\t\t\t\t\t\t\t}\n\t\t\t}\n\t\t\t,\t\t\t\t{\n\t\t\t\t\"@type\": \"Question\",\n\t\t\t\t\"name\": \"How much are UPC codes?\",\n\t\t\t\t\"acceptedAnswer\": {\n\t\t\t\t\t\"@type\": \"Answer\",\n\t\t\t\t\t\"text\": \"We sell codes starting at $5 per code, with bulk discounts available. UPC code prices vary on the internet, but we're the cheapest legitimate seller online.  Be careful of companies selling cheaper codes online as there are a lot of fake codes out there.  The GS1 is the most expensive place because when purchasing directly from the GS1, you are required to purchase a prefix.  However, owning a prefix is not a requirement and the GS1 doesn't store any product information.  As a result, you can buy codes for a fraction of the cost as the GS1 that work fine for all your needs.  All of our codes come from the GS1.\"\n\t\t\t\t\t\t\t\t\t}\n\t\t\t}\n\t\t\t,\t\t\t\t{\n\t\t\t\t\"@type\": \"Question\",\n\t\t\t\t\"name\": \"How do I get a UPC for Amazon?\",\n\t\t\t\t\"acceptedAnswer\": {\n\t\t\t\t\t\"@type\": \"Answer\",\n\t\t\t\t\t\"text\": \"If you want to sell a product, in most cases, a UPC barcode is required.  We issue the UPC to your company and then you can register your product information with the vendor(s) that you sell at.  On Amazon, we wrote a guide on how to use UPC codes on Amazon here.\"\n\t\t\t\t\t\t\t\t\t}\n\t\t\t}\n\t\t\t,\t\t\t\t{\n\t\t\t\t\"@type\": \"Question\",\n\t\t\t\t\"name\": \"What is a UPC code?\",\n\t\t\t\t\"acceptedAnswer\": {\n\t\t\t\t\t\"@type\": \"Answer\",\n\t\t\t\t\t\"text\": \"A UPC is a universal product code which is used to manage inventory, assign products to codes in stock, prevent duplication of products in a catalog.  You can read more about UPCs here on Wikipedia.\"\n\t\t\t\t\t\t\t\t\t}\n\t\t\t}\n\t\t\t\t\t\t]\n\t}\n<\/script>\n<\/span><\/p>\n<h3 class=\"p1\">How do you buy UPC codes?<\/h3>\n<p>You can purchase UPC codes directly on our site at upcs.com.  All of our codes come from the GS1 with no renewal or hidden fees, and are delivered instantly at checkout.  They work with all vendors including Amazon, Google Shopping, iTunes, eBay, and more!<\/p>\n<h3 class=\"p1\"><span class=\"s1\">How much are UPC codes?<\/span><\/h3>\n<p>We sell codes starting at $5 per code, with bulk discounts available. UPC code prices vary on the internet, but we&#8217;re the cheapest legitimate seller online.  Be careful of companies selling cheaper codes online as there are a lot of fake codes out there.  The GS1 is the most expensive place because when purchasing directly from the GS1, you are required to purchase a prefix.  However, owning a prefix is not a requirement and the GS1 doesn&#8217;t store any product information.  As a result, you can buy codes for a fraction of the cost as the GS1 that work fine for all your needs.  All of our codes come from the GS1.<\/p>\n<h3 class=\"p1\">How do I get a UPC for Amazon?<\/h3>\n<p>Simply go to <a href=\"https:\/\/upcs.com\/buy-upc-now\/\">our UPC page<\/a>, select the quantity you want, and proceed to checkout.  Your codes will be delivered within 1 minute after you send your payment.  All of our codes work on Amazon.  For more information on <a href=\"https:\/\/upcs.com\/how-to-buy-upc-codes-amazon\">how to buy Amazon UPC Codes, visit our guide here.<\/a><\/p>\n<h3 class=\"p1\">Do I need to buy a UPC barcode?<\/h3>\n<p>If you want to sell a product, in most cases, a UPC barcode is required.  We issue the UPC to your company and then you can register your product information with the vendor(s) that you sell at.  On Amazon, <a href=\"https:\/\/upcs.com\/amazon-upc-codes\/\">we wrote a guide on how to use UPC codes on Amazon here<\/a>.<\/p>\n<h3>How do I buy a UPC code for Amazon?<\/h3>\n<p>Simply go to <a href=\"https:\/\/upcs.com\/buy-upc-now\/\">our UPC page<\/a>, select the quantity you want, and proceed to checkout.  Your codes will be delivered within 1 minute after you send your payment.  All of our codes work on Amazon.  For more information on <a href=\"https:\/\/upcs.com\/how-to-buy-upc-codes-amazon\">how to buy Amazon UPC Codes, visit our guide here.<\/a><\/p>\n<h3>What do I receive with my order?<\/h3>\n<p>Every order comes with a .csv file with your UPC code(s) that can be used right away, along with a .zip file with the barcode(s) associated with those codes.  The barcodes come in the following formats: .TIFF, .JPG, .PNG, and .PDF.  If you need any other formats, we&#8217;re glad to help provide them to you. A certificate and\/or invoice can be provided, by request.<\/p>\n<h3>How much does it cost to get a UPC code?<\/h3>\n<p>One code costs $5, but the more you buy, the cheaper each code is.  For example, if you buy 100 codes, the cost per code is only $0.45.  Please see our <a href=\"https:\/\/upcs.com\/buy-upc-now\/\">Buy UPC Codes<\/a> page for full pricing options.<\/p>\n<h3>How do I buy a barcode?<\/h3>\n<p>A barcode is simply a visual representation of a UPC\/EAN code.  We send barcodes by default with all orders, though if you need specific sizes, please visit <a href=\"https:\/\/upcs.com\/buy-barcodes\/\">our Barcodes page<\/a> where you can generate them as needed with your UPCs.<\/p>\n<h3>Can you print labels for my barcodes?<\/h3>\n<p>Yes, we now offer printing services.  We will print your barcodes (and Amazon FNSKU labels if needed) and ship them to you.  We also sell blank labels if you wish to print them yourself. <a href=\"https:\/\/upcs.com\/barcode-labels\/\">Checkout our Barcode Labels page here to order now<\/a>.<\/p>\n<h3>What is a UPC code?<\/h3>\n<p>A UPC is a universal product code which is used to manage inventory, assign products to codes in stock, prevent duplication of products in a catalog.  You can read more about <a href=\"https:\/\/en.wikipedia.org\/wiki\/Universal_Product_Code\" target=\"_blank\" rel=\"noopener noreferrer\">UPCs here on Wikipedia<\/a>.<\/p>\n<h3><strong>Amazon changed their policy, do your codes still work?<\/strong><\/h3>\n<p>Yes, our codes still work, just as they have for 15+ years.  Some people suggest that Amazon won&#8217;t accept 3rd party codes, but this is not true.  They simply want GS1 verified codes, and not &#8220;air codes&#8221; that don&#8217;t verify with the GS1.  Our codes verify with the GS1 and are accepted on all major platforms and services, including Amazon. <a href=\"https:\/\/upcs.com\/how-to-buy-upc-codes-amazon\">Find more information here<\/a>.<\/p>\n<h3><strong>My codes are only 11 digits, why?<\/strong><\/h3>\n<p>If you purchased a UPC code from us, it will always be 12 or 13 digits. However, depending on how you&#8217;re viewing the codes, any 0 at the beginning may be truncated.  Simply add a leading 0 to the code and it will resolve the problem.<\/p>\n<h3><strong>My codes aren&#8217;t formatted correctly or showing as all the same, what do I do?<\/strong><\/h3>\n<p>If your code is showing in the csv spreadsheet as 1.234E+12 or something other than a 12 or 13 digit number, you simply need to reformat the cell display in your settings.  For Excel, see<a href=\"http:\/\/www.extendoffice.com\/documents\/excel\/1725-excel-convert-scientific-notation-to-text.html#a2\" target=\"_blank\" rel=\"noopener noreferrer\"> this page<\/a> to adjust this.  It is normally under Format &gt; Cells &gt; Number &gt; 0 Decimal Places.<\/p>\n<h3>&#8220;You are using UPCs, EANs, ISBNs, ASINs, or JAN codes that do not match the products you are trying to list.&#8221;<\/h3>\n<p>This error typically happens on Amazon if you’re listing a Brand that already has UPCs and Amazon is restricting the Brand from adding more UPCs (to prevent duplicate listings).  The issue typically isn’t with the UPCs themselves, but with the restrictions placed on the Brand.  To test if this is a Brand restriction, change the “Brand” field to something else unique and it should solve the issue.  If the issue goes away, we know it was a Brand restriction.<\/p>\n<p>If the issue doesn’t go away after changing the Brand, please contact us answering the following questions:<br \/>\n1. What is the Brand name and Product Title you’re testing with?<br \/>\n2. Do you have Brand Registry?<br \/>\n3. Are you creating a variation listing or a parent item?<br \/>\nOnce we get this information, we can assist you further.<\/p>\n<h3><strong>Where is my barcode, all I received is a number?<\/strong><\/h3>\n<p>With each order we send you 2 files, 1 with your codes, and 1 with your barcodes. However, with the UPC code(s), you can easily generate barcodes to your own specifications if the ones we send aren&#8217;t the correct format, size, etc.  Please checkout our <a title=\"Barcodes\" href=\"https:\/\/upcs.com\/buy-barcodes\/\">Barcodes page<\/a> to generate your own if you have specific criteria, it only takes 30 seconds and is free.  Note that if you&#8217;re selling on Amazon, you can use the barcodes we provide, generate your own at the link above, or you can have Amazon generate a product label for you.<\/p>\n<h3><strong>Amazon says it needs to be 13 digits, how do I fix this?<\/strong><\/h3>\n<p>Simply add a leading 0 to the UPC code you bought and this will resolve the issue.<\/p>\n<h3>How do I get Walmart UPC Codes?<\/h3>\n<p>All of our codes at UPCs.com work at Walmart.  Simply order your codes as usual and create your listings on Walmart.  It&#8217;s also best practice to create your listings prior to barcoding your products.  In some cases, Walmart may require you rent from the GS1 directly, in which case we&#8217;re glad to help you with that.<\/p>\n<h3><strong>How fast can I get my codes after purchasing them?<\/strong><\/h3>\n<p>Instantly. Upon payment you will receive a notification email containing all of the UPC codes that you purchased.  You can also download them from the Checkout Complete page after you complete the payment.<\/p>\n<h3><strong>Will my UPC codes work for Amazon.com with no issues?<\/strong><\/h3>\n<p>Yes, all of our UPC codes are guaranteed to never been previously issued\/used and will work instantly on Amazon with no problems.<\/p>\n<h3><strong>When I search the GS1 database, a different company comes up, not mine. Why?<br \/>\n<\/strong><\/h3>\n<p>The <span class=\"m_-8114917362512673006gmail-m_-303409365796712670gmail-il\"><span class=\"m_-8114917362512673006gmail-il\"><span class=\"il\">GS1<\/span><\/span><\/span> prefix owner name doesn&#8217;t change in the database even though UPCs do change ownership all the time, hence why an unfamiliar company may show up.<\/p>\n<div>All that company means in the <span class=\"m_-8114917362512673006gmail-m_-303409365796712670gmail-il\"><span class=\"m_-8114917362512673006gmail-il\"><span class=\"il\">GS1<\/span><\/span><\/span> database is that the code is <span class=\"m_-8114917362512673006gmail-m_-303409365796712670gmail-m_6431282290990126240gmail-il\"><span class=\"m_-8114917362512673006gmail-m_-303409365796712670gmail-il\"><span class=\"m_-8114917362512673006gmail-il\"><span class=\"il\">GS1<\/span><\/span><\/span><\/span> <span class=\"m_-8114917362512673006gmail-m_-303409365796712670gmail-m_6431282290990126240gmail-il\"><span class=\"m_-8114917362512673006gmail-m_-303409365796712670gmail-il\"><span class=\"m_-8114917362512673006gmail-il\"><span class=\"il\">verified<\/span><\/span><\/span><\/span>.  The name in the database is the original prefix owner, not the current UPC owner.  We own many prefixes (UCC &#8211; pre 2002) which we can issue codes from. Your code will work fine on Amazon\/Google\/iTunes, etc. without issue, and we offer a money back guarantee.  You can read about the <a href=\"https:\/\/upcs.com\/ucc-gs1-settlement\/\">UCC Settlement Agreement here<\/a>.<\/div>\n<h3><strong>How do I get my UPC Codes once I&#8217;ve paid for them?<\/strong><\/h3>\n<p>Once your payment has been processed, you will INSTANTLY receive an email with your UPC \/ EAN Codes, as well as barcodes. You can <a href=\"https:\/\/upcs.com\/buy-barcodes\/\">generate barcodes to your specifications here.<\/a> If you&#8217;re selling on Amazon, Amazon will automatically generate barcodes\/product labels for you after you enter in your UPC\/EAN.<\/p>\n<h3><strong>Where can I use the UPC Codes that I purchase from you?<\/strong><\/h3>\n<p>Your UPC Codes will work everywhere online and at most retails, unless they require that you purchase your own company prefix from GS1-US.  In that case, we recommend that purchase your own GS1-US company prefix.<\/p>\n<h3><strong>I want to sell my book; do I need a UPC, EAN or ISBN number?<\/strong><\/h3>\n<p>If you&#8217;re selling your book through a retail outlet, the retailer will generally require that you obtain an ISBN. The ISBN is a 13 digit number that properly identifies the book title and the publisher&#8217;s contact information. We recommend that you check your store&#8217;s requirements on UPC and ISBN codes before purchasing from us. Sometimes you can get away with just using a UPC code and then you can purchase the UPC codes from us. However, we do not offer ISBN&#8217;s at this time.<\/p>\n<h3><strong>I want to sell a magazine, will a UPC code work?<\/strong><\/h3>\n<p>Most magazines usually require special bar codes with 5-digit BIPAD numbers that are encoded in them. However, some retailers accept regular UPC or EAN codes. We recommend checking into your retailer first in advance to find out their specific requirements. If they don&#8217;t require a BIPAD number, then you can purchase UPC codes through us to put on your magazine.<\/p>\n<h3><strong>I&#8217;m planning on selling cd&#8217;s in a retail situation can I use your UPC Codes?<\/strong><\/h3>\n<p>Yes, our UPC codes will work perfectly for your cd&#8217;s in any retail situation. If you happen to be an independent artist, your UPC code will also allow you to register your music with SoundScan so that you can track your sales and improve your marketing efforts.<\/p>\n<h3><strong>What is included in my UPC Code Order?<\/strong><\/h3>\n<p>You instantly receive the codes delivered to your inbox via email.  You will receive 2 attachments, 1 will be a .csv with your codes, and 1 with be a .zip with the barcode representation of the codes.  See <a href=\"http:\/\/www.free-barcode-generator.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">this site<\/a> if you want to generate in a different format.<\/p>\n<h3><strong>What is a UPC \/ EAN Code?<\/strong><\/h3>\n<p>UPC stands for Universal Product Code, EAN is an European Article Number which are specific 12-digit or 13-digit barcodes which allows retailers to manage sales and inventory of a product. UPC Codes are required for all general use products in the USA and Canada. EAN Codes are a 13-digit barcode that is valid in all countries.<\/p>\n<h3><strong>Do I need to register my UPC Codes?<\/strong><\/h3>\n<p>We recommend after purchasing you register your UPC codes at the vendor you first plan to sell.  For example, with Amazon, you can do so <a href=\"https:\/\/upcs.com\/amazon-upc-codes\/\">following the instructions here<\/a>.<\/p>\n<p>The next step in the Barcode\/Product Association\/Registration process for you as the barcode owner is to provide to your retailers the following: Barcode Number, Product Description, Product Price, and Company name.<\/p>\n<p>Your retailers will take that information and enter it into their store&#8217;s database so that when the barcode is scanned, your product information is shown.<\/p>\n<p>We would also recommend entering your barcode numbers and product information into the UPC Database <a href=\"https:\/\/www.barcodelookup.com\/add-a-barcode\">here<\/a>.<\/p>\n<p>There is no cost for this service, and it allows you to promote your products online, as well as associate your barcode numbers with your company.<b><\/b><\/p>\n<h3 class=\"p1\"><strong>Why isn’t my company name coming up when scanned by my smartphone?<\/strong><\/h3>\n<p class=\"p1\">Until you upload your product to Amazon, Google Merchant Center, or a database that your specific smartphone scanner application is using, it will pull directly from GS1’s database. This information is outdated and doesn’t record the current owner of that specific UPC\/EAN number.<\/p>\n<h3><strong>Am I receiving legitimate UPC Codes?<\/strong><\/h3>\n<p>Yes, UPCs.com provides you with a UPC Code that is unique, valid and guaranteed to never have been issued. Since our company prefix was obtained prior to the changes in the GS1-US Licensing Agreement we are well within our legal rights to provide UPC Codes to our customers.  Read more on the <a href=\"https:\/\/upcs.com\/ucc-gs1-settlement\/\">UCC\/GS1 Settlement Agreement<\/a> page.<\/p>\n<h3><strong>When I purchase my UPC Codes from you, am I purchasing the company prefix?<\/strong><\/h3>\n<p>When you purchase UPC Codes from us, you are purchasing the rights to unique UPC&#8217;s that are YOURS to use, however you are not purchasing the company prefix. UPC&#8217;s from UPCs.com are assigned and sold from our company prefixes that we maintain. If your distributor\/retailer requires that you own the company prefix, you will need to contact GS1-US directly to obtain your company prefix.<\/p>\n<h3><strong>Do I have to have a UPC code in order to sell my products online?<\/strong><\/h3>\n<p>You will only need to have UPC codes to sell your products online if the online retailer requires that you have a UPC code.<\/p>\n<h3><strong>Will my UPC Codes ever expire?<\/strong><\/h3>\n<p>No, once you purchase your UPC codes through us, they&#8217;re yours to keep for life! There are no fees or any other expenses.<\/p>\n<h3><strong>Will my UPC codes work in a country other than the USA and Canada?<\/strong><\/h3>\n<p>Yes, your UPC codes will work in ANY country where UPC and EAN codes are scanned, worldwide!<\/p>\n<h3><strong>Will my UPC codes be unique to me\/my products?<\/strong><\/h3>\n<p>Yes, our UPC codes originate from GS1-US and are guaranteed to be unique and never issued before. YOU will be the only person in the world who can legally use the UPC Codes that you purchase.<\/p>\n<h3><strong>Do I need a separate UPC Codes for every product?<\/strong><\/h3>\n<p>Yes, you need a different UPC code for each UNIQUE product that you sell. For example, let&#8217;s imagine you have a t-shirt company and you want to sell 3 different color shirts of the same size, you&#8217;ll need 3 UPC codes. Then, let&#8217;s imagine you have 3 different colored shirts in 3 different sizes, you&#8217;ll need a total of 9 UPC Codes.<\/p>\n<p>Need more help, <a title=\"Contact Us\" href=\"http:\/\/upcs.com\/contact-us\/\">contact us<\/a> and we&#8217;d be glad to help.  We also have a <a href=\"https:\/\/upcs.com\/coupon\/\">UPCs.com Coupon<\/a> here if you&#8217;ve read this prior to purchasing.<\/p>\n<p>Thanks for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Below you will find a list of questions that will answer the most common questions about UPC codes and their use.  Please fully read through this page and contact us if you have any other questions. How do you buy &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/upcs.com\/frequently-asked-questions\/\"> <span class=\"screen-reader-text\">Frequently Asked Questions<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"full-width-page.php","meta":{"_mi_skip_tracking":false},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Frequently Asked Questions - UPCs.com<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/upcs.com\/frequently-asked-questions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Frequently Asked Questions - UPCs.com\" \/>\n<meta property=\"og:description\" content=\"Below you will find a list of questions that will answer the most common questions about UPC codes and their use.  Please fully read through this page and contact us if you have any other questions. How do you buy &hellip; Frequently Asked Questions Read More &raquo;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/upcs.com\/frequently-asked-questions\/\" \/>\n<meta property=\"og:site_name\" content=\"UPCs.com\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-30T06:19:26+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/upcs.com\/#organization\",\"name\":\"SnapUPC\",\"url\":\"https:\/\/upcs.com\/\",\"sameAs\":[],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/upcs.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/upcs.com\/wp-content\/uploads\/2022\/05\/upcs-logo.png\",\"contentUrl\":\"https:\/\/upcs.com\/wp-content\/uploads\/2022\/05\/upcs-logo.png\",\"width\":262,\"height\":92,\"caption\":\"SnapUPC\"},\"image\":{\"@id\":\"https:\/\/upcs.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/upcs.com\/#website\",\"url\":\"https:\/\/upcs.com\/\",\"name\":\"UPCs.com\",\"description\":\"Your trusted, leading UPC seller\",\"publisher\":{\"@id\":\"https:\/\/upcs.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/upcs.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/upcs.com\/frequently-asked-questions\/\",\"url\":\"https:\/\/upcs.com\/frequently-asked-questions\/\",\"name\":\"Frequently Asked Questions - UPCs.com\",\"isPartOf\":{\"@id\":\"https:\/\/upcs.com\/#website\"},\"datePublished\":\"2014-09-18T18:12:54+00:00\",\"dateModified\":\"2021-12-30T06:19:26+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/upcs.com\/frequently-asked-questions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/upcs.com\/frequently-asked-questions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/upcs.com\/frequently-asked-questions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/upcs.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Frequently Asked Questions\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Frequently Asked Questions - UPCs.com","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/upcs.com\/frequently-asked-questions\/","og_locale":"en_US","og_type":"article","og_title":"Frequently Asked Questions - UPCs.com","og_description":"Below you will find a list of questions that will answer the most common questions about UPC codes and their use.  Please fully read through this page and contact us if you have any other questions. How do you buy &hellip; Frequently Asked Questions Read More &raquo;","og_url":"https:\/\/upcs.com\/frequently-asked-questions\/","og_site_name":"UPCs.com","article_modified_time":"2021-12-30T06:19:26+00:00","twitter_card":"summary","twitter_misc":{"Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/upcs.com\/#organization","name":"SnapUPC","url":"https:\/\/upcs.com\/","sameAs":[],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/upcs.com\/#\/schema\/logo\/image\/","url":"https:\/\/upcs.com\/wp-content\/uploads\/2022\/05\/upcs-logo.png","contentUrl":"https:\/\/upcs.com\/wp-content\/uploads\/2022\/05\/upcs-logo.png","width":262,"height":92,"caption":"SnapUPC"},"image":{"@id":"https:\/\/upcs.com\/#\/schema\/logo\/image\/"}},{"@type":"WebSite","@id":"https:\/\/upcs.com\/#website","url":"https:\/\/upcs.com\/","name":"UPCs.com","description":"Your trusted, leading UPC seller","publisher":{"@id":"https:\/\/upcs.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/upcs.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/upcs.com\/frequently-asked-questions\/","url":"https:\/\/upcs.com\/frequently-asked-questions\/","name":"Frequently Asked Questions - UPCs.com","isPartOf":{"@id":"https:\/\/upcs.com\/#website"},"datePublished":"2014-09-18T18:12:54+00:00","dateModified":"2021-12-30T06:19:26+00:00","breadcrumb":{"@id":"https:\/\/upcs.com\/frequently-asked-questions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/upcs.com\/frequently-asked-questions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/upcs.com\/frequently-asked-questions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/upcs.com\/"},{"@type":"ListItem","position":2,"name":"Frequently Asked Questions"}]}]}},"_links":{"self":[{"href":"https:\/\/upcs.com\/wp-json\/wp\/v2\/pages\/58"}],"collection":[{"href":"https:\/\/upcs.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/upcs.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/upcs.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/upcs.com\/wp-json\/wp\/v2\/comments?post=58"}],"version-history":[{"count":40,"href":"https:\/\/upcs.com\/wp-json\/wp\/v2\/pages\/58\/revisions"}],"predecessor-version":[{"id":367442,"href":"https:\/\/upcs.com\/wp-json\/wp\/v2\/pages\/58\/revisions\/367442"}],"wp:attachment":[{"href":"https:\/\/upcs.com\/wp-json\/wp\/v2\/media?parent=58"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}